УТ_для_edt.РасширениеСмарт/src/Enums/CRM_ВходящееИсходящееСобытие/CRM_ВходящееИсходящееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe56be15-4ba4-429c-8eb6-27f08d73e0d4">
  <name>CRM_ВходящееИсходящееСобытие</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="6b76ead7-eb6d-4dfc-976c-421a3319176b">
    <name>Исходящее</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КонтактныеЛицаПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <attributes extendedConfigurationObject="29cd916a-e579-4b2a-8c42-645cfd2a9521">
    <name>ДолжностьПоВизитке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="07a989fe-b7de-44b6-839d-e1cce1d2d423">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4b318cc3-2f5c-4b35-9733-92b8480d218b">
    <name>смартЛогинНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cd170420-6eb1-4342-ac01-7cc15a278469">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="45c407b4-0b68-47cd-a142-a06f4a184f90">
    <name>смартЭлектроннаяПочтаНаСайте</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67d2f639-09f9-487b-aefa-c42471c9026b">
    <name>ДатаРегистрацииСвязи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1507bf85-d479-4d4c-b34f-ae3f3fbe92d0">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Заметки/Заметки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Заметки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекстСодержания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Пометка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДляРабочегоСтола</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаЗаметки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПредставлениеПредмета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9cca9751-c599-4906-ad10-d4c17fd84503">
    <name>смартКвалификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/CommonModules/CRM_ЛентаСобытийПовтИсп/Module.bsl
#Область ПеренесеноСДоработкамиСмарт

&ИзменениеИКонтроль("ТекстЗапросаДанныхЛенты")
Функция смарт_ТекстЗапросаДанныхЛенты(Знач ПараметрыЗапроса)
	
	ТекстыЗапросаМассив = Новый Массив;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЖурналДокументов.Объект                    КАК Ссылка,
	|	ТИПЗНАЧЕНИЯ(ЖурналДокументов.Объект)       КАК ТипОбъекта,
	|	ЖурналДокументов.Дата                      КАК Дата,
	|	ЖурналДокументов.Номер                     КАК Номер,
	|	ЖурналДокументов.Сумма                     КАК Сумма,
	|	ЖурналДокументов.Валюта                    КАК Валюта,
	|	ЖурналДокументов.Автор                     КАК Автор,
	|	ЖурналДокументов.Проведен                  КАК Проведен,";
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
		ТекстЗапроса = "
		|	""""                                   КАК ТемаИнтереса,
		|	НЕОПРЕДЕЛЕНО                           КАК ТипОбращенияИнтереса,
		|	НЕОПРЕДЕЛЕНО                           КАК Интерес,
		|	ИСТИНА                                 КАК ОсновнойИнтерес,";
	ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКлиента" Или ПараметрыЗапроса.Режим = "ЛентаКонтакта" Тогда
		ТекстЗапроса = "
		|	ЖурналДокументов.CRM_Интерес.Тема      КАК ТемаИнтереса,
		|	ЖурналДокументов.CRM_Интерес.ТипОбращения      КАК ТипОбращенияИнтереса,
		|	ЖурналДокументов.CRM_Интерес           КАК Интерес,
		|	ЖурналДокументов.ОсновнойИнтерес       КАК ОсновнойИнтерес,";
	КонецЕсли;
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = "
	|	ПРЕДСТАВЛЕНИЕ(ЖурналДокументов.ТипОбъекта) КАК Вид
	|ПОМЕСТИТЬ ОбъектыЖурналаОтбор
	|ИЗ
	|	РегистрСведений.CRM_ЖурналДокументов КАК ЖурналДокументов";
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
		ТекстЗапроса = "
		|ГДЕ
		|	ЖурналДокументов.CRM_Интерес = &Объект";
	ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКлиента" Тогда
		ТекстЗапроса = "
		|ГДЕ
		|	ЖурналДокументов.Клиент = &Объект
		|	И ЖурналДокументов.КонтактноеЛицо В (&ДоступныеКонтакты)";
	ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКонтакта" Тогда
		ТекстЗапроса = "
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛица
		|		ПО ЖурналДокументов.КонтактноеЛицо = КонтактныеЛица.Ссылка
		|			И ЖурналДокументов.КонтактноеЛицо = &Объект
		|			И ЖурналДокументов.Клиент = КонтактныеЛица.Владелец";
	КонецЕсли;
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыЖурнала.Ссылка     КАК Ссылка,
	|	ОбъектыЖурнала.ТипОбъекта КАК ТипОбъекта,
	|	ОбъектыЖурнала.Дата       КАК Дата,
	|	ОбъектыЖурнала.Номер      КАК Номер,
	|	ОбъектыЖурнала.Сумма      КАК Сумма,
	|	ОбъектыЖурнала.Валюта     КАК Валюта,
	|	ОбъектыЖурнала.Автор      КАК Автор,
	|	ОбъектыЖурнала.Проведен   КАК Проведен,
	|	ОбъектыЖурнала.Вид        КАК Вид
	|ПОМЕСТИТЬ УникальныеОбъектыЖурнала
	|ИЗ
	|	ОбъектыЖурналаОтбор КАК ОбъектыЖурнала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыЖурнала.Ссылка       КАК Ссылка,
	|	ОбъектыЖурнала.ТемаИнтереса КАК ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес      КАК Интерес
	|ПОМЕСТИТЬ ИнтересыПоОбъектам
	|ИЗ
	|	ОбъектыЖурналаОтбор КАК ОбъектыЖурнала
	|ГДЕ
	|	ОбъектыЖурнала.ОсновнойИнтерес
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыЖурнала.Ссылка                              КАК Ссылка,
	|	ОбъектыЖурнала.ТипОбъекта                          КАК ТипОбъекта,
	|	ОбъектыЖурнала.Дата                                КАК Дата,
	|	ОбъектыЖурнала.Номер                               КАК Номер,
	|	ОбъектыЖурнала.Сумма                               КАК Сумма,
	|	ОбъектыЖурнала.Валюта                              КАК Валюта,
	|	ОбъектыЖурнала.Автор                               КАК Автор,
	|	ОбъектыЖурнала.Проведен                            КАК Проведен,
	|	ОбъектыЖурнала.Вид                                 КАК Вид,
	|	ЕСТЬNULL(ИнтересыПоОбъектам.ТемаИнтереса, """")    КАК ТемаИнтереса,
	|	ЕСТЬNULL(ИнтересыПоОбъектам.ТипОбращенияИнтереса, НЕОПРЕДЕЛЕНО)    КАК ТипОбращенияИнтереса,
	|	ЕСТЬNULL(ИнтересыПоОбъектам.Интерес, НЕОПРЕДЕЛЕНО) КАК Интерес
	|ПОМЕСТИТЬ ВсеОбъектыЖурнала
	|ИЗ
	|	УникальныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИнтересыПоОбъектам КАК ИнтересыПоОбъектам
	|		ПО ОбъектыЖурнала.Ссылка = ИнтересыПоОбъектам.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОбъектыЖурнала.Ссылка       КАК Ссылка,
	|	ВсеОбъектыЖурнала.Дата         КАК Дата,
	|	ВсеОбъектыЖурнала.Номер        КАК Номер,
	|	ВсеОбъектыЖурнала.Сумма        КАК Сумма,
	|	ВсеОбъектыЖурнала.Валюта       КАК Валюта,
	|	ВсеОбъектыЖурнала.Автор        КАК Автор,
	|	ВсеОбъектыЖурнала.Проведен     КАК Проведен,
	|	ВсеОбъектыЖурнала.Вид          КАК Вид,
	|	ВсеОбъектыЖурнала.ТемаИнтереса КАК ТемаИнтереса,
	|	ВсеОбъектыЖурнала.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ВсеОбъектыЖурнала.Интерес      КАК Интерес
	|ПОМЕСТИТЬ ПрочиеОбъектыЖурнала
	|ИЗ
	|	ВсеОбъектыЖурнала КАК ВсеОбъектыЖурнала
	|ГДЕ
	|	ВсеОбъектыЖурнала.ТипОбъекта В(&ПрочиеТипыОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеОбъектыЖурнала.Ссылка       КАК Ссылка,
	|	ВсеОбъектыЖурнала.Дата         КАК Дата,
	|	ВсеОбъектыЖурнала.Номер        КАК Номер,
	|	ВсеОбъектыЖурнала.Сумма        КАК Сумма,
	|	ВсеОбъектыЖурнала.Валюта       КАК Валюта,
	|	ВсеОбъектыЖурнала.Автор        КАК Автор,
	|	ВсеОбъектыЖурнала.Проведен     КАК Проведен,
	|	ВсеОбъектыЖурнала.Вид          КАК Вид,
	|	ВсеОбъектыЖурнала.ТемаИнтереса КАК ТемаИнтереса,
	|	ВсеОбъектыЖурнала.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ВсеОбъектыЖурнала.Интерес      КАК Интерес
	|ПОМЕСТИТЬ ВыбранныеОбъектыЖурнала
	|ИЗ
	|	ВсеОбъектыЖурнала КАК ВсеОбъектыЖурнала
	|ГДЕ
	|	ВсеОбъектыЖурнала.ТипОбъекта В(&ВключенныеТипыОбъектов)
	|	ИЛИ (ВсеОбъектыЖурнала.ТипОбъекта = &ТипИнтерес И ВсеОбъектыЖурнала.ТипОбращенияИнтереса В(&ВключенныеТипыОбращений))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА                                                                КАК ЕстьКоманды,
	|	ЛОЖЬ                                                                  КАК Группировка,
	|	ИСТИНА                                                                КАК ЕстьФайлы,
	|	ОбъектыЖурнала.Ссылка                                                 КАК Ссылка,
	|	Взаимодействие.ПлановаяДата                                           КАК Дата,
	|	ОбъектыЖурнала.Номер                                                  КАК Номер,
	|	Взаимодействие.Тема                                                   КАК Тема,
	|	""ВзаимодействиеПланов""                                              КАК Тип,
	|	Взаимодействие.Ответственный                                          КАК Отправитель,
	|	СтатусыВзаимодействий.ТипСостояния                                    КАК Состояние,
	|	Взаимодействие.КонтактноеЛицо                                         КАК Получатель,
	|	ЛОЖЬ                                                                  КАК Входящий,
	|	РАЗНОСТЬДАТ(Взаимодействие.ПлановаяДатаЗавершение, &ТекущаяДата, ЧАС) КАК Длительность,
	|	НЕОПРЕДЕЛЕНО                                                          КАК УчетнаяЗапись,
	|	0                                                                     КАК Сумма,
	|	НЕОПРЕДЕЛЕНО                                                          КАК Валюта,
	|	Взаимодействие.Результат                                              КАК Результат,
	|	Взаимодействие.ВидВзаимодействия                                      КАК Вид,
	|	ОбъектыЖурнала.ТемаИнтереса                                           КАК ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса                                   КАК ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес                                                КАК Интерес
	|ПОМЕСТИТЬ ДанныеОбъектовПланов
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК Взаимодействие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО Взаимодействие.Ссылка = ОбъектыЖурнала.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияСобытий КАК СтатусыВзаимодействий
	|		ПО Взаимодействие.СтатусВзаимодействия = СтатусыВзаимодействий.Ссылка
	|			И (СтатусыВзаимодействий.ТипСостояния В (ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Запланировано), ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.ВРаботе)))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_ВидыВзаимодействий КАК ВидыВзаимодействий
	|		ПО Взаимодействие.ВидВзаимодействия = ВидыВзаимодействий.Ссылка
	|			И ВидыВзаимодействий.Направление = ЗНАЧЕНИЕ(Перечисление.CRM_ВходящееИсходящееСобытие.Исходящее)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА                                                                КАК ЕстьКоманды,
	|	ЛОЖЬ                                                                  КАК Группировка,
	|	ИСТИНА                                                                КАК ЕстьФайлы,
	|	ОбъектыЖурнала.Ссылка                                                 КАК Ссылка,
	|	ЗадачаИсполнителя.СрокИсполнения                                      КАК Дата,
	|	ОбъектыЖурнала.Номер                                                  КАК Номер,
	|	ЗадачаИсполнителя.Наименование                                        КАК Тема,
	|	""ЗадачаПланов""                                                      КАК Тип,
	|	ЗадачаИсполнителя.Автор                                               КАК Отправитель,
	|	ЗадачаИсполнителя.ПометкаУдаления                                     КАК Состояние,
	|	ВЫБОР
	|		КОГДА ЗадачаИсполнителя.Исполнитель = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		КОГДА ЗадачаИсполнителя.Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		КОГДА ЗадачаИсполнителя.Исполнитель = ЗНАЧЕНИЕ(Справочник.ВнешниеПользователи.ПустаяСсылка)
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		ИНАЧЕ ЗадачаИсполнителя.Исполнитель
	|	КОНЕЦ                                                                 КАК Получатель,
	|	НЕОПРЕДЕЛЕНО                                                          КАК Входящий,
	|	РАЗНОСТЬДАТ(ЗадачаИсполнителя.СрокИсполнения, &ТекущаяДата, ЧАС)      КАК Длительность,
	|	НЕОПРЕДЕЛЕНО                                                          КАК УчетнаяЗапись,
	|	0                                                                     КАК Сумма,
	|	НЕОПРЕДЕЛЕНО                                                          КАК Валюта,
	|	ЗадачаИсполнителя.РезультатВыполнения                                 КАК Результат,
	|	ЗадачаИсполнителя.CRM_Личная                                          КАК Вид,
	|	ОбъектыЖурнала.ТемаИнтереса                                           КАК ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса                                   КАК ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес                                                КАК Интерес
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ЗадачаИсполнителя.Ссылка = ОбъектыЖурнала.Ссылка
	#Удаление //++ #Б-5762 смарт: Фролов 18.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
	|			И НЕ( ЗадачаИсполнителя.Выполнена ИЛИ ЗадачаИсполнителя.ПометкаУдаления)
	#КонецУдаления
	#Вставка
	//++ #Б-5762 смарт: Фролов 19.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
	|			И НЕ( ЗадачаИсполнителя.Выполнена ИЛИ ЗадачаИсполнителя.ПометкаУдаления ИЛИ ЗадачаИсполнителя.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.РазобратьсяСИнцидентом))
	//-- #Б-5762 смарт: Фролов 19.02.2026
	#КонецВставки
	|			И НЕ (ЗадачаИсполнителя.CRM_ТочкаМаршрута<>Значение(Справочник.CRM_ТочкиМаршрутов.ПустаяСсылка) И ЗадачаИсполнителя.CRM_ТочкаМаршрута.Вид = Значение(Перечисление.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИСТИНА                                                                КАК ЕстьКоманды,
	|	ЛОЖЬ                                                                  КАК Группировка,
	|	ИСТИНА                                                                КАК ЕстьФайлы,
	|	ОбъектыЖурнала.Ссылка                                                 КАК Ссылка,
	|	ВЫБОР
	|		КОГДА СтатусыВзаимодейтсвий.ТипСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Завершено)
	|			ТОГДА Взаимодействие.ДатаЗавершенияВзаимодействия
	|		ИНАЧЕ Взаимодействие.ПлановаяДатаЗавершение
	|	КОНЕЦ                                                                 КАК Дата,
	|	ОбъектыЖурнала.Номер                                                  КАК Номер,
	|	Взаимодействие.Тема                                                   КАК Тема,
	|	""ВзаимодействиеИстории""                                             КАК Тип,
	|	Взаимодействие.Ответственный                                          КАК Отправитель,
	|	СтатусыВзаимодейтсвий.ТипСостояния                                    КАК Состояние,
	|	Взаимодействие.КонтактноеЛицо                                         КАК Получатель,
	|	ВЫБОР
	|		КОГДА ВидыВзаимодействий.Направление = ЗНАЧЕНИЕ(Перечисление.CRM_ВходящееИсходящееСобытие.Входящее)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                                                                 КАК Входящий,
	|	ВЫБОР
	|		КОГДА СтатусыВзаимодейтсвий.ТипСостояния = ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Завершено)
	|			ТОГДА РАЗНОСТЬДАТ(Взаимодействие.ДатаЗавершенияВзаимодействия, Взаимодействие.ПлановаяДатаЗавершение, ЧАС)
	|		ИНАЧЕ РАЗНОСТЬДАТ(Взаимодействие.ПлановаяДатаЗавершение, &ТекущаяДата, ЧАС)
	|	КОНЕЦ                                                                 КАК Длительность,
	|	НЕОПРЕДЕЛЕНО                                                          КАК УчетнаяЗапись,
	|	0                                                                     КАК Сумма,
	|	НЕОПРЕДЕЛЕНО                                                          КАК Валюта,
	|	Взаимодействие.Результат                                              КАК Результат,
	|	Взаимодействие.ВидВзаимодействия                                      КАК Вид,
	|	ОбъектыЖурнала.ТемаИнтереса                                           КАК ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса                                   КАК ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес                                                КАК Интерес
	|ПОМЕСТИТЬ ДанныеОбъектовИстории
	|ИЗ
	|	Документ.CRM_Взаимодействие КАК Взаимодействие
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО Взаимодействие.Ссылка = ОбъектыЖурнала.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияСобытий КАК СтатусыВзаимодейтсвий
	|		ПО Взаимодействие.СтатусВзаимодействия = СтатусыВзаимодейтсвий.Ссылка
	|			И (СтатусыВзаимодейтсвий.ТипСостояния В (ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Завершено), ЗНАЧЕНИЕ(Перечисление.CRM_ТипыСостоянийСобытий.Отменено)))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CRM_ВидыВзаимодействий КАК ВидыВзаимодействий
	|		ПО Взаимодействие.ВидВзаимодействия = ВидыВзаимодействий.Ссылка
	|			И ВидыВзаимодействий.Ссылка В (&ВключенныеВидыВзаимодействий)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА                                                                КАК ЕстьКоманды,
	|	ЛОЖЬ                                                                  КАК Группировка,
	|	ИСТИНА                                                                КАК ЕстьФайлы,
	|	ОбъектыЖурнала.Ссылка                                                 КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ЗадачаИсполнителя.ПометкаУдаления
	|			ТОГДА ЗадачаИсполнителя.СрокИсполнения
	|		ИНАЧЕ ЗадачаИсполнителя.ДатаИсполнения
	|	КОНЕЦ                                                                 КАК Дата,
	|	ОбъектыЖурнала.Номер                                                  КАК Номер,
	|	ЗадачаИсполнителя.Наименование                                        КАК Тема,
	|	""ЗадачаИстории""                                                     КАК Тип,
	|	ЗадачаИсполнителя.Автор                                               КАК Отправитель,
	|	ЗадачаИсполнителя.ПометкаУдаления                                     КАК Состояние,
	|	ВЫБОР
	|		КОГДА ЗадачаИсполнителя.Исполнитель = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		КОГДА ЗадачаИсполнителя.Исполнитель = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		КОГДА ЗадачаИсполнителя.Исполнитель = ЗНАЧЕНИЕ(Справочник.ВнешниеПользователи.ПустаяСсылка)
	|			ТОГДА ЗадачаИсполнителя.РольИсполнителя
	|		ИНАЧЕ ЗадачаИсполнителя.Исполнитель
	|	КОНЕЦ                                                                 КАК Получатель,
	|	НЕОПРЕДЕЛЕНО                                                          КАК Входящий,
	|	0                                                                     КАК Длительность,
	|	НЕОПРЕДЕЛЕНО                                                          КАК УчетнаяЗапись,
	|	0                                                                     КАК Сумма,
	|	НЕОПРЕДЕЛЕНО                                                          КАК Валюта,
	|	ЗадачаИсполнителя.РезультатВыполнения                                 КАК Результат,
	|	ЗадачаИсполнителя.CRM_Личная                                          КАК Вид,
	|	ОбъектыЖурнала.ТемаИнтереса                                           КАК ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса                                   КАК ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес                                                КАК Интерес
	|ИЗ
	|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ЗадачаИсполнителя.Ссылка = ОбъектыЖурнала.Ссылка
	|			И (ЗадачаИсполнителя.Выполнена ИЛИ ЗадачаИсполнителя.ПометкаУдаления)
	#Вставка 
	//++ #Б-5762 смарт: Фролов 18.02.2026 //Добавить механизм Инцидентов в справочник Партнеры.
	|			И НЕ ЗадачаИсполнителя.смартВидЗадачи = ЗНАЧЕНИЕ(Справочник.смартВидыЗадач.РазобратьсяСИнцидентом)
	//-- #Б-5762 смарт: Фролов 19.02.2026
	#КонецВставки
	|			И НЕ (ЗадачаИсполнителя.CRM_ТочкаМаршрута<>Значение(Справочник.CRM_ТочкиМаршрутов.ПустаяСсылка) И ЗадачаИсполнителя.CRM_ТочкаМаршрута.Вид = Значение(Перечисление.CRM_ВидыТочекМаршрута.ВложенныйБизнесПроцесс))";
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	Если ПараметрыЗапроса.ВключеныФайлы Тогда
		
		Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
			ИмяСправочникаФайлы = "CRM_ИнтересПрисоединенныеФайлы";
		ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКлиента" Тогда
			ИмяСправочникаФайлы = "ПартнерыПрисоединенныеФайлы";
		ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКонтакта" Тогда
			ИмяСправочникаФайлы = "КонтактныеЛицаПартнеровПрисоединенныеФайлы";
		КонецЕсли;
		
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА,
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ПрисоединенныеФайлы.Ссылка,
		|	ПрисоединенныеФайлы.ДатаСоздания,
		|	"""" КАК Номер,
		|	ПрисоединенныеФайлы.Наименование,
		|	""Файл"",
		|	ПрисоединенныеФайлы.Автор,
		|	ПрисоединенныеФайлы.ПометкаУдаления,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	ПрисоединенныеФайлы.Размер,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	ПрисоединенныеФайлы.Описание,
		|	ПрисоединенныеФайлы.Расширение,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник."+ ИмяСправочникаФайлы +" КАК ПрисоединенныеФайлы
		|ГДЕ
		|	ПрисоединенныеФайлы.ВладелецФайла = &Объект
		|	И НЕ ПрисоединенныеФайлы.ЭтоГруппа";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.ВключеныПримечания Тогда
		
		#Удаление //++ #1981 смарт: Фролов 13.08.2024 //Показ заметок по результатам квалификации Интереса в карточке Партнера.
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	Заметка.Ссылка,
		|	Заметка.ДатаИзменения,
		|	"""",
		|	Заметка.ТекстСодержания,
		|	""Примечание"",
		|	Заметка.Автор,
		|	Заметка.ПометкаУдаления,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.Заметки КАК Заметка
		|ГДЕ
		|	Заметка.Предмет = &Объект
		|	И Заметка.CRM_ЗаметкаЛенты";
		#КонецУдаления
		
		
		#Вставка
		//++ #1981 смарт: Фролов 13.08.2024 //Показ заметок по результатам квалификации Интереса в карточке Партнера.
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	Заметка.Ссылка,
		|	Заметка.ДатаИзменения,
		|	"""",
		|	Заметка.ТекстСодержания,
		|	""Примечание"",
		|	Заметка.Автор,
		|	Заметка.ПометкаУдаления,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.Заметки КАК Заметка
		|ГДЕ
		|  (Заметка.Предмет В (&МассивПредметов)
		|  	ИЛИ Заметка.смартПартнер В (&МассивПредметов))
		|  И Заметка.CRM_ЗаметкаЛенты";
		
		//-- #1981 смарт: Фролов 13.08.2024
		#КонецВставки
		
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	КонецЕсли;
	#Вставка
	//++ #1566 смарт: Фролов 26.01.2024 //Коэффициенты менеджеров для автоматического распределения лидов
	Если ПараметрыЗапроса.Режим = "ЛентаКлиента" ИЛИ ПараметрыЗапроса.Режим = "ЛентаКонтакта" Тогда  
	ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	смартЛид.Ссылка,
		|	смартЛид.Дата,
		|	"""",
		|	ВЫБОР
		|		КОГДА смартЛид.Продукт = """"
		|			ТОГДА (ВЫРАЗИТЬ(смартЛид.Тема КАК СТРОКА(100))) + "" Тип: "" + (ВЫРАЗИТЬ(смартЛид.ТипТовара КАК СТРОКА(100)))
		|		ИНАЧЕ (ВЫРАЗИТЬ(смартЛид.Тема КАК СТРОКА(100))) + "" Продукт: "" + (ВЫРАЗИТЬ(смартЛид.Продукт КАК СТРОКА(100)))
		|	КОНЕЦ,
		|	""Лид"",
		|	смартЛид.Ответственный,
		|	смартЛид.ПометкаУдаления,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Документ.смартЛид КАК смартЛид
		|ГДЕ
		|	"+?(ПараметрыЗапроса.Режим = "ЛентаКлиента"," смартЛид.Партнер "," смартЛид.КонтактноеЛицо ")+" = &Объект";
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	КонецЕсли;	
	//-- #1566 смарт: Фролов 26.01.2024
	#КонецВставки	
	
	#Вставка 
	//++ #1865 смарт: Фролов 17.06.2024 //Вывод в интересе информации о звонке по номеру указанному в данных из обращения (если нет партнера)
	Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
		
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА,
		|	ИСТИНА,
		|	ИСТИНА,
		|	Ссылка,
		|	Дата,
		|	Номер,
		|	Комментарий,
		|	""ТелефонныйЗвонок"",
		|	ВЫБОР
		|		КОГДА Входящий
		|			ТОГДА АбонентПредставление
		|		ИНАЧЕ Автор
		|	КОНЕЦ,
		|	сфпСостояниеЗвонка,
		|	ВЫБОР
		|		КОГДА Входящий
		|			ТОГДА Ответственный
		|		ИНАЧЕ АбонентПредставление
		|	КОНЕЦ,
		|	Входящий,
		|	сфпДлительностьЗвонка,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Документ.ТелефонныйЗвонок
		|ГДЕ
		|	АбонентКакСвязаться ПОДОБНО &ТелефонАбонента";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	//-- #1865 смарт: Фролов 17.06.2024	
	#КонецВставки
	
	#Вставка 
	//++ #1917 смарт: Фролов 15.07.2024 //Показывать звонки по партнеру в ленте Интересов.
	Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
		
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИСТИНА,
		|	ИСТИНА,
		|	ИСТИНА,
		|	Ссылка,
		|	Дата,
		|	Номер,
		|	Комментарий,
		|	""ТелефонныйЗвонок"",
		|	ВЫБОР
		|		КОГДА Входящий
		|			ТОГДА АбонентПредставление
		|		ИНАЧЕ Автор
		|	КОНЕЦ,
		|	сфпСостояниеЗвонка,
		|	ВЫБОР
		|		КОГДА Входящий
		|			ТОГДА Ответственный
		|		ИНАЧЕ АбонентПредставление
		|	КОНЕЦ,
		|	Входящий,
		|	сфпДлительностьЗвонка,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Документ.ТелефонныйЗвонок
		|ГДЕ
		|	ВЫБОР
		|		КОГДА АбонентКонтакт ССЫЛКА Справочник.Партнеры
		|			ТОГДА АбонентКонтакт В (&МассивПредметов)
		|		ИНАЧЕ ВЫБОР
		|				КОГДА АбонентКонтакт ССЫЛКА Справочник.КонтактныеЛицаПартнеров
		|					ТОГДА АбонентКонтакт.Владелец В (&МассивПредметов)
		|			КОНЕЦ
		|	КОНЕЦ";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	//-- #1917 смарт: Фролов 15.07.2024	
	#КонецВставки
	
	ТекстЗапроса = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	ТелефонныйЗвонок.Комментарий,
	|	""ТелефонныйЗвонок"",
	|	ВЫБОР
	|		КОГДА ТелефонныйЗвонок.Входящий
	|			ТОГДА ТелефонныйЗвонок.АбонентПредставление
	|		ИНАЧЕ ТелефонныйЗвонок.Автор
	|	КОНЕЦ,
	|	ТелефонныйЗвонок.сфпСостояниеЗвонка,
	|	ВЫБОР
	|		КОГДА ТелефонныйЗвонок.Входящий
	|			ТОГДА ТелефонныйЗвонок.Ответственный
	|		ИНАЧЕ ТелефонныйЗвонок.АбонентПредставление
	|	КОНЕЦ,
	|	ТелефонныйЗвонок.Входящий,
	|	ТелефонныйЗвонок.сфпДлительностьЗвонка,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.ТелефонныйЗвонок КАК ТелефонныйЗвонок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ТелефонныйЗвонок.Ссылка = ОбъектыЖурнала.Ссылка
	|ГДЕ
	|	ТелефонныйЗвонок.Входящий В (&ВключенныеНаправленияЗвонков)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	ЭлектронноеПисьмоВходящее.Тема,
	|	""ЭлектронноеПисьмо"",
	|	ЭлектронноеПисьмоВходящее.ОтправительПредставление,
	|	НЕОПРЕДЕЛЕНО,
	|	ЭлектронноеПисьмоВходящее.СписокПолучателейПисьма,
	|	ИСТИНА,
	|	0,
	|	ЭлектронноеПисьмоВходящее.УчетнаяЗапись,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.ЭлектронноеПисьмоВходящее КАК ЭлектронноеПисьмоВходящее
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ЭлектронноеПисьмоВходящее.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ВЫБОР
	|		КОГДА ЭлектронноеПисьмоИсходящее.СтатусПисьма = ЗНАЧЕНИЕ(Перечисление.СтатусыИсходящегоЭлектронногоПисьма.Отправлено)
	|			ТОГДА ЭлектронноеПисьмоИсходящее.ДатаОтправления
	|		ИНАЧЕ ЭлектронноеПисьмоИсходящее.Дата
	|	КОНЕЦ,
	|	ОбъектыЖурнала.Номер,
	|	ЭлектронноеПисьмоИсходящее.Тема,
	|	""ЭлектронноеПисьмо"",
	|	ЭлектронноеПисьмоИсходящее.Автор,
	|	ЭлектронноеПисьмоИсходящее.СтатусПисьма,
	|	ЭлектронноеПисьмоИсходящее.СписокПолучателейПисьма,
	|	ЛОЖЬ,
	|	0,
	|	ЭлектронноеПисьмоИсходящее.УчетнаяЗапись,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ЭлектронноеПисьмоИсходящее.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// +Рарус alexpr
	//|ВЫБРАТЬ
	//|	ИСТИНА,
	//|	ИСТИНА,
	//|	ИСТИНА,
	//|	ОбъектыЖурнала.Ссылка,
	//|	ОбъектыЖурнала.Дата,
	//|	ОбъектыЖурнала.Номер,
	//|	СообщениеМессенджера.ТекстСообщения,
	//|	""СообщениеЧата"",
	//|	ВЫБОР
	//|		КОГДА СообщениеМессенджера.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСообщенияМессенджера.Входящее)
	//|			ТОГДА
	//|				ВЫБОР
	//|					КОГДА СообщениеМессенджера.Контакт В (&ПустыеЗначенияКонтактов)
	//|						ТОГДА СообщениеМессенджера.КонтактПредставление
	//|					ИНАЧЕ СообщениеМессенджера.Контакт
	//|				КОНЕЦ
	//|		ИНАЧЕ СообщениеМессенджера.Ответственный
	//|	КОНЕЦ,
	//|	СообщениеМессенджера.Прочитано,
	//|	ВЫБОР
	//|		КОГДА СообщениеМессенджера.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСообщенияМессенджера.Входящее)
	//|			ТОГДА
	//|				ВЫБОР
	//|					КОГДА СообщениеМессенджера.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	//|						ТОГДА СообщениеМессенджера.CRM_РольОтветственного
	//|					ИНАЧЕ СообщениеМессенджера.Ответственный
	//|				КОНЕЦ
	//|		ИНАЧЕ
	//|				ВЫБОР
	//|					КОГДА СообщениеМессенджера.Контакт В (&ПустыеЗначенияКонтактов)
	//|						ТОГДА СообщениеМессенджера.КонтактПредставление
	//|					ИНАЧЕ СообщениеМессенджера.Контакт
	//|				КОНЕЦ
	//|	КОНЕЦ,
	//|	ВЫБОР
	//|		КОГДА СообщениеМессенджера.ВидСообщения = ЗНАЧЕНИЕ(Перечисление.CRM_ВидыСообщенияМессенджера.Входящее)
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ,
	//|	0,
	//|	СообщениеМессенджера.УчетнаяЗапись,
	//|	0,
	//|	СообщениеМессенджера.Группа,
	//|	СообщениеМессенджера.ID_Пользователя,
	//|	СообщениеМессенджера.КонтактПредставление,
	//|	ОбъектыЖурнала.ТемаИнтереса,
	//|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	//|	ОбъектыЖурнала.Интерес
	//|ИЗ
	//|	Документ.CRM_СообщениеМессенджера КАК СообщениеМессенджера
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	//|		ПО СообщениеМессенджера.Ссылка = ОбъектыЖурнала.Ссылка
	//|ГДЕ
	//|	СообщениеМессенджера.ВидСообщения В (&ВключенныеНаправленияЧатов)
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	CRM_СообщенияДиалоговПоследние.Дата,
	|	CRM_Диалоги.Код,
	|	CRM_СообщенияДиалоговПоследние.ТекстСокр,
	|	""Диалог"",
	|	ВЫБОР
	|		КОГДА CRM_Диалоги.Контакт В (&ПустыеЗначенияКонтактов)
	|			ТОГДА CRM_Диалоги.КонтактПредставление
	|			ИНАЧЕ CRM_Диалоги.Контакт
	|	КОНЕЦ,
	|	Истина,
	|	ВЫБОР
	|		КОГДА CRM_Диалоги.Ответственный = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|			ТОГДА CRM_Диалоги.CRM_РольОтветственного
	|			ИНАЧЕ CRM_Диалоги.Ответственный
	|	КОНЕЦ,
	|	ИСТИНА,
	|	0,
	|	CRM_Диалоги.УчетнаяЗапись,
	|	0,
	|	CRM_Диалоги.Группа,
	|	CRM_Диалоги.ID_Пользователя,
	|	CRM_Диалоги.КонтактПредставление,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Справочник.CRM_Диалоги КАК CRM_Диалоги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО CRM_Диалоги.Ссылка = ОбъектыЖурнала.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_СообщенияДиалоговПоследние КАК CRM_СообщенияДиалоговПоследние
	|		ПО CRM_СообщенияДиалоговПоследние.Диалог = CRM_Диалоги.Ссылка
	// -Рарус alexpr
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ИСТИНА,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	СообщениеSMS.Тема,
	|	""СообщениеSMS"",
	|	СообщениеSMS.Автор,
	|	ВЫБОР
	|		КОГДА СообщениеSMS.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументаСообщениеSMS.Доставлено)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	СообщениеSMS.СписокУчастников,
	|	ВЫБОР
	|		КОГДА СообщениеSMS.SMS4B_ТипСообщения = ЗНАЧЕНИЕ(Перечисление.SMS4B_ТипыСообщений.Входящее)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.СообщениеSMS КАК СообщениеSMS
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО СообщениеSMS.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	Заявка.Тема,
	|	""Заявка"",
	|	Заявка.Наименование,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ИСТИНА,
	|	0,
	|	Заявка.ИсточникПолучения,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	"""",
	|	Заявка.Организация,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.CRM_Заявка КАК Заявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО Заявка.Ссылка = ОбъектыЖурнала.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	ДокументИнтерес.Тема,
	|	""Интерес"",
	|	ДокументИнтерес.Ответственный,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	ДокументИнтерес.ТипОбращения,
	|	ОбъектыЖурнала.Сумма,
	|	ОбъектыЖурнала.Валюта,
	|	"""",
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.CRM_Интерес КАК ДокументИнтерес
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО ДокументИнтерес.Ссылка = ОбъектыЖурнала.Ссылка";
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
		ТекстЗапроса = "
		|			И ДокументИнтерес.ДокументОснование = &Объект";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	КонецЕсли;
	
	ТекстЗапроса = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ИСТИНА,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	"""",
	|	""КоммерческоеПредложение"",
	|	ОбъектыЖурнала.Автор,
	|	ОбъектыЖурнала.Проведен,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.Сумма,
	|	ОбъектыЖурнала.Валюта,
	|	"""",
	|	ОбъектыЖурнала.Вид,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	Документ.КоммерческоеПредложениеКлиенту КАК КоммерческоеПредложение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыбранныеОбъектыЖурнала КАК ОбъектыЖурнала
	|		ПО КоммерческоеПредложение.Ссылка = ОбъектыЖурнала.Ссылка";
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = "
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.Ссылка,
	|	ОбъектыЖурнала.Дата,
	|	ОбъектыЖурнала.Номер,
	|	"""",
	|	""ПрочийДокумент"",
	|	ОбъектыЖурнала.Автор,
	|	ОбъектыЖурнала.Проведен,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	НЕОПРЕДЕЛЕНО,
	|	ОбъектыЖурнала.Сумма,
	|	ОбъектыЖурнала.Валюта,
	|	"""",
	|	ОбъектыЖурнала.Вид,
	|	ОбъектыЖурнала.ТемаИнтереса,
	|	ОбъектыЖурнала.ТипОбращенияИнтереса,
	|	ОбъектыЖурнала.Интерес
	|ИЗ
	|	ПрочиеОбъектыЖурнала КАК ОбъектыЖурнала";
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	// Записи о создании объекта.
	Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ДокументИнтерес.Ссылка,
		|	ДокументИнтерес.Дата,
		|	ДокументИнтерес.Номер,
		|	ДокументИнтерес.Тема,
		|	""СозданиеОбъекта"",
		|	ДокументИнтерес.Автор,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	ДокументИнтерес.ТипОбращения,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Документ.CRM_Интерес КАК ДокументИнтерес
		|ГДЕ
		|	ДокументИнтерес.Ссылка = &Объект";
	ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКлиента" Тогда
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	Партнеры.Ссылка,
		|	Партнеры.ДатаРегистрации,
		|	"""",
		|	Партнеры.Наименование,
		|	""СозданиеОбъекта"",
		|	Партнеры.CRM_Автор,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.Партнеры КАК Партнеры
		|ГДЕ
		|	Партнеры.Ссылка = &Объект";
	Иначе
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	Контакты.Ссылка,
		|	Контакты.ДатаРегистрацииСвязи,
		|	"""",
		|	Контакты.Наименование,
		|	""СозданиеОбъекта"",
		|	Контакты.Автор,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	Справочник.КонтактныеЛицаПартнеров КАК Контакты
		|ГДЕ
		|	Контакты.Ссылка = &Объект";
	КонецЕсли;
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	Если ПараметрыЗапроса.ВключеноИзменениеСостояния И ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
		
		// История изменений состояния.
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЗаписиИстории.Партнер,
		|	ЗаписиИстории.Период,
		|	"""",
		|	"""",
		|	""ЗаписьИстории"",
		|	ЗаписиИстории.СтароеЗначение,
		|	ЗаписиИстории.ЭтоНовый,
		|	ЗаписиИстории.Значение,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	ЗаписиИстории.Автор,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	ЕСТЬNULL(ОписаниеРеквизитов.Представление, ЗаписиИстории.ПутьКДанным),
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	РегистрСведений.CRM_ИсторияРеквизитовПартнеров КАК ЗаписиИстории
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОписаниеРеквизитовМетаданных КАК ОписаниеРеквизитов
		|		ПО ЗаписиИстории.ПутьКДанным = ОписаниеРеквизитов.Реквизит
		|			И ОписаниеРеквизитов.Объект = ""Документ.CRM_Интерес""";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
		ТекстЗапроса = "
		|ГДЕ
		|	ЗаписиИстории.Партнер = &Объект
		|		И НЕ ЗаписиИстории.ЭтоНовый
		|		И ЗаписиИстории.ПутьКДанным = ""СостояниеИнтереса""";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.ВключеноИзменениеОтветственного
		И (ПараметрыЗапроса.Режим = "ЛентаИнтереса" Или ПараметрыЗапроса.Режим = "ЛентаКлиента") Тогда
		
		// История изменений ответственного.
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЗаписиИстории.Партнер,
		|	ЗаписиИстории.Период,
		|	"""",
		|	"""",
		|	""ЗаписьИстории"",
		|	ЗаписиИстории.СтароеЗначение,
		|	ЗаписиИстории.ЭтоНовый,
		|	ЗаписиИстории.Значение,
		|	НЕОПРЕДЕЛЕНО,
		|	0,
		|	ЗаписиИстории.Автор,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	ЕСТЬNULL(ОписаниеРеквизитов.Представление, ЗаписиИстории.ПутьКДанным),
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	РегистрСведений.CRM_ИсторияРеквизитовПартнеров КАК ЗаписиИстории
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОписаниеРеквизитовМетаданных КАК ОписаниеРеквизитов
		|		ПО ЗаписиИстории.ПутьКДанным = ОписаниеРеквизитов.Реквизит";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
		Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
			ТекстЗапроса = "
			|			И ОписаниеРеквизитов.Объект = ""Документ.CRM_Интерес""
			|ГДЕ
			|	ЗаписиИстории.Партнер = &Объект
			|		И НЕ ЗаписиИстории.ЭтоНовый
			|		И ЗаписиИстории.ПутьКДанным = ""Ответственный""";
		ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКлиента" Тогда
			ТекстЗапроса = "
			|			И ОписаниеРеквизитов.Объект = ""Справочник.Партнеры""
			|ГДЕ
			|	ЗаписиИстории.Партнер = &Объект
			|		И НЕ ЗаписиИстории.ЭтоНовый
			|		И ЗаписиИстории.ПутьКДанным = ""ОсновнойМенеджер""";
		КонецЕсли;
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.ВключенаИстория Тогда
		
		Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
			
			// Запись о завершении интереса.
			ТекстЗапроса = "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЛОЖЬ,
			|	ЛОЖЬ,
			|	ЛОЖЬ,
			|	ДокументИнтерес.Ссылка,
			|	ДокументИнтерес.ДатаЗакрытия,
			|	ДокументИнтерес.Номер,
			|	ДокументИнтерес.Тема,
			|	""ЗавершениеИнтереса"",
			|	ДокументИнтерес.Ответственный,
			|	ВЫБОР
			|		КОГДА ДокументИнтерес.ПричинаОтказа = ЗНАЧЕНИЕ(Справочник.CRM_ПричиныОтказаПоИнтересам.ПустаяСсылка)
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ,
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО,
			|	0,
			|	ДокументИнтерес.ТипОбращения,
			|	0,
			|	НЕОПРЕДЕЛЕНО,
			|	"""",
			|	НЕОПРЕДЕЛЕНО,
			|	"""",
			|	НЕОПРЕДЕЛЕНО,
			|	НЕОПРЕДЕЛЕНО
			|ИЗ
			|	Документ.CRM_Интерес КАК ДокументИнтерес
			|ГДЕ
			|	ДокументИнтерес.Ссылка = &Объект
			|	И ДокументИнтерес.Завершен";
			ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
			
		КонецЕсли;
		
		// История изменения реквизитов.
		ТекстЗапроса = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЗаписиИстории.Партнер,
		|	ЗаписиИстории.Период,
		|	"""",
		|	"""",
		|	""ЗаписьИстории"",
		|	ЗаписиИстории.СтароеЗначение,
		|	ЗаписиИстории.ЭтоНовый,
		|	ЗаписиИстории.Значение,
		|	НЕОПРЕДЕЛЕНО,
		|	ЗаписиИстории.ВидЗаписи,
		|	ЗаписиИстории.Автор,
		|	0,
		|	НЕОПРЕДЕЛЕНО,
		|	"""",
		|	ЕСТЬNULL(ОписаниеРеквизитов.Представление, ЗаписиИстории.ПутьКДанным),
		|	"""",
		|	НЕОПРЕДЕЛЕНО,
		|	НЕОПРЕДЕЛЕНО
		|ИЗ
		|	РегистрСведений.CRM_ИсторияРеквизитовПартнеров КАК ЗаписиИстории
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CRM_ОписаниеРеквизитовМетаданных КАК ОписаниеРеквизитов
		|		ПО ЗаписиИстории.ПутьКДанным = ОписаниеРеквизитов.Реквизит";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
		Если ПараметрыЗапроса.Режим = "ЛентаИнтереса" Тогда
			ТекстЗапроса = "
			|			И ОписаниеРеквизитов.Объект = ""Документ.CRM_Интерес""";
		ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКлиента" Тогда
			ТекстЗапроса = "
			|			И ОписаниеРеквизитов.Объект = ""Справочник.Партнеры""";
		ИначеЕсли ПараметрыЗапроса.Режим = "ЛентаКонтакта" Тогда
			ТекстЗапроса = "
			|			И ОписаниеРеквизитов.Объект = ""Справочник.КонтактныеЛицаПартнеров""";
		КонецЕсли;
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
		ТекстЗапроса = "
		|ГДЕ
		|	ЗаписиИстории.Партнер = &Объект
		|		И НЕ ЗаписиИстории.ЭтоНовый
		|		И НЕ ЗаписиИстории.ПутьКДанным В (""СостояниеИнтереса"", ""Ответственный"", ""ОсновнойМенеджер"")";
		ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
		
	КонецЕсли;
	
	// Финальная выборка с количеством объектов.
	ТекстЗапроса = "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ" + ?(ПараметрыЗапроса.ОбъектовИстории > 0, " ПЕРВЫЕ " + СтрЗаменить(ПараметрыЗапроса.ОбъектовИстории, Символы.НПП, ""), "") + "
	|	ДанныеОбъектов.ЕстьКоманды               КАК ЕстьКоманды,
	|	ДанныеОбъектов.ЕстьФайлы                 КАК ЕстьФайлы,
	|	ДанныеОбъектов.Группировка               КАК Группировка,
	|	ДанныеОбъектов.Тип                       КАК Тип,
	|	ДанныеОбъектов.Дата                      КАК Дата,
	|	ДанныеОбъектов.Номер                     КАК Номер,
	|	ДанныеОбъектов.Входящий                  КАК Входящий,
	|	ДанныеОбъектов.Отправитель               КАК Отправитель,
	|	ДанныеОбъектов.Получатель                КАК Получатель,
	|	ДанныеОбъектов.Состояние                 КАК Состояние,
	|	ДанныеОбъектов.Длительность              КАК Длительность,
	|	ДанныеОбъектов.Тема                      КАК Тема,
	|	ДанныеОбъектов.Ссылка                    КАК Ссылка,
	|	ДанныеОбъектов.УчетнаяЗапись             КАК УчетнаяЗапись,
	|	ДанныеОбъектов.Сумма                     КАК Сумма,
	|	ДанныеОбъектов.Валюта                    КАК Валюта,
	|	ДанныеОбъектов.Результат                 КАК Результат,
	|	ДанныеОбъектов.Вид                       КАК Вид,
	|	ДанныеОбъектов.ТемаИнтереса              КАК ТемаИнтереса,
	|	ДанныеОбъектов.ТипОбращенияИнтереса      КАК ТипОбращенияИнтереса,
	|	ДанныеОбъектов.Интерес                   КАК Интерес
	|ПОМЕСТИТЬ ДанныеОбъектовИсторииСортировка
	|ИЗ
	|	ДанныеОбъектовИстории КАК ДанныеОбъектов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ,
	|	Тип
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ДанныеОбъектов.Ссылка) КАК Количество
	|ИЗ
	|	ДанныеОбъектовИстории КАК ДанныеОбъектов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	0                                        КАК Раздел,
	|	ДанныеОбъектов.ЕстьКоманды               КАК ЕстьКоманды,
	|	ДанныеОбъектов.ЕстьФайлы                 КАК ЕстьФайлы,
	|	ДанныеОбъектов.Группировка               КАК Группировка,
	|	ДанныеОбъектов.Тип                       КАК Тип,
	|	ДанныеОбъектов.Дата                      КАК Дата,
	|	ДанныеОбъектов.Номер                     КАК Номер,
	|	НАЧАЛОПЕРИОДА(ДанныеОбъектов.Дата, ДЕНЬ) КАК ДатаБезВремени,
	|	ГОД(ДанныеОбъектов.Дата)                 КАК Год,
	|	ДанныеОбъектов.Входящий                  КАК Входящий,
	|	ДанныеОбъектов.Отправитель               КАК Отправитель,
	|	ДанныеОбъектов.Получатель                КАК Получатель,
	|	ДанныеОбъектов.Состояние                 КАК Состояние,
	|	ДанныеОбъектов.Длительность              КАК Длительность,
	|	ДанныеОбъектов.Тема                      КАК Тема,
	|	ДанныеОбъектов.Ссылка                    КАК Ссылка,
	|	ДанныеОбъектов.УчетнаяЗапись             КАК УчетнаяЗапись,
	|	ДанныеОбъектов.Сумма                     КАК Сумма,
	|	ДанныеОбъектов.Валюта                    КАК Валюта,
	|	ДанныеОбъектов.Результат                 КАК Результат,
	|	ДанныеОбъектов.Вид                       КАК Вид,
	|	ДанныеОбъектов.ТемаИнтереса              КАК ТемаИнтереса,
	|	ДанныеОбъектов.ТипОбращенияИнтереса      КАК ТипОбращенияИнтереса,
	|	ДанныеОбъектов.Интерес                   КАК Интерес
	#Вставка
	//++ #Б-4092 смарт: Фролов 19.08.2025 //После рефакторинга загрузки звонков в 1С, некоторые звонки в ленте дублируются
	|ПОМЕСТИТЬ ПредварительныйИтог
	//-- #Б-4092 смарт: Фролов 19.08.2025
	#КонецВставки
	|ИЗ
	|	ДанныеОбъектовПланов КАК ДанныеОбъектов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1                                        КАК Раздел,
	|	ДанныеОбъектов.ЕстьКоманды               КАК ЕстьКоманды,
	|	ДанныеОбъектов.ЕстьФайлы                 КАК ЕстьФайлы,
	|	ДанныеОбъектов.Группировка               КАК Группировка,
	|	ДанныеОбъектов.Тип                       КАК Тип,
	|	ДанныеОбъектов.Дата                      КАК Дата,
	|	ДанныеОбъектов.Номер                     КАК Номер,
	|	НАЧАЛОПЕРИОДА(ДанныеОбъектов.Дата, ДЕНЬ) КАК ДатаБезВремени,
	|	ГОД(ДанныеОбъектов.Дата)                 КАК Год,
	|	ДанныеОбъектов.Входящий                  КАК Входящий,
	|	ДанныеОбъектов.Отправитель               КАК Отправитель,
	|	ДанныеОбъектов.Получатель                КАК Получатель,
	|	ДанныеОбъектов.Состояние                 КАК Состояние,
	|	ДанныеОбъектов.Длительность              КАК Длительность,
	|	ДанныеОбъектов.Тема                      КАК Тема,
	|	ДанныеОбъектов.Ссылка                    КАК Ссылка,
	|	ДанныеОбъектов.УчетнаяЗапись             КАК УчетнаяЗапись,
	|	ДанныеОбъектов.Сумма                     КАК Сумма,
	|	ДанныеОбъектов.Валюта                    КАК Валюта,
	|	ДанныеОбъектов.Результат                 КАК Результат,
	|	ДанныеОбъектов.Вид                       КАК Вид,
	|	ДанныеОбъектов.ТемаИнтереса              КАК ТемаИнтереса,
	|	ДанныеОбъектов.ТипОбращенияИнтереса      КАК ТипОбращенияИнтереса,
	|	ДанныеОбъектов.Интерес                   КАК Интерес
	|ИЗ
	|	ДанныеОбъектовИсторииСортировка КАК ДанныеОбъектов
	#Удаление //++ #Б-4092 смарт: Фролов 19.08.2025 //После рефакторинга загрузки звонков в 1С, некоторые звонки в ленте дублируются
	|УПОРЯДОЧИТЬ ПО
	|	Раздел,
	|	Дата УБЫВ,
	|	Тип";
	#КонецУдаления
	#Вставка
	//++ #Б-4092 смарт: Фролов 19.08.2025 //После рефакторинга загрузки звонков в 1С, некоторые звонки в ленте дублируются
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПредварительныйИтог.Раздел КАК Раздел,
	|	ПредварительныйИтог.ЕстьКоманды КАК ЕстьКоманды,
	|	ПредварительныйИтог.ЕстьФайлы КАК ЕстьФайлы,
	|	ПредварительныйИтог.Группировка КАК Группировка,
	|	ПредварительныйИтог.Тип КАК Тип,
	|	ПредварительныйИтог.Дата КАК Дата,
	|	ПредварительныйИтог.Номер КАК Номер,
	|	ПредварительныйИтог.ДатаБезВремени КАК ДатаБезВремени,
	|	ПредварительныйИтог.Год КАК Год,
	|	ПредварительныйИтог.Входящий КАК Входящий,
	|	ПредварительныйИтог.Отправитель КАК Отправитель,
	|	ПредварительныйИтог.Получатель КАК Получатель,
	|	ПредварительныйИтог.Состояние КАК Состояние,
	|	ПредварительныйИтог.Длительность КАК Длительность,
	|	ПОДСТРОКА(ПредварительныйИтог.Тема, 0, 350) КАК Тема,
	|	ПредварительныйИтог.Ссылка КАК Ссылка,
	|	ПредварительныйИтог.УчетнаяЗапись КАК УчетнаяЗапись,
	|	ПредварительныйИтог.Сумма КАК Сумма,
	|	ПредварительныйИтог.Валюта КАК Валюта,
	|	ПОДСТРОКА(ПредварительныйИтог.Результат, 0, 350) КАК Результат,
	|	ПредварительныйИтог.Вид КАК Вид,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПредварительныйИтог.ТемаИнтереса, """") = НЕОПРЕДЕЛЕНО
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(ПредварительныйИтог.ТемаИнтереса, """")
	|	КОНЕЦ,
	|	ПредварительныйИтог.ТипОбращенияИнтереса КАК ТипОбращенияИнтереса,
	|	ПредварительныйИтог.Интерес КАК Интерес
	|ИЗ
	|	ПредварительныйИтог КАК ПредварительныйИтог
	|
	|УПОРЯДОЧИТЬ ПО
	|	Раздел,
	|	Дата УБЫВ,
	|	Тип";
	//-- #Б-4092 смарт: Фролов 19.08.2025
	#КонецВставки
	ТекстыЗапросаМассив.Добавить(ТекстЗапроса);
	
	Возврат СтрСоединить(ТекстыЗапросаМассив);
	
КонецФункции

&ИзменениеИКонтроль("ОтборыОбъектовЛенты")
//++ #Б-3738 смарт: Фролов 08.07.2025 //Вывод событий в ленте Интереса, только по этому Интересу.
Функция смарт_ОтборыОбъектовЛенты(Знач НастройкиЛенты)

	ОтборЛенты = Новый СписокЗначений;
	
	ОтборЛенты.Добавить("ВсеСобытия",		НСтр("ru='Все события';en='All events'"),				Истина);
	//ОтборЛенты.Добавить("Взаимодействия",	НСтр("ru='Завершенные взаимодействия';en='Finished Interactions'"),		Истина);

	#Вставка
	//++ #Б-3738 смарт: Фролов 08.07.2025 //Вывод событий в ленте Интереса, только по этому Интересу.
	Если НастройкиЛенты.Режим = "ЛентаИнтереса" Тогда
	
		ОтборЛенты.Добавить("смартПоВсемОтветственным",		НСтр("ru='По всем ответственным';en='All those responsible'"),				Истина);
		
	КонецЕсли;	
	//-- #Б-3738 смарт: Фролов 08.07.2025
	#КонецВставки
	
	ОтборЛенты.Добавить("Задачи",			НСтр("ru='Завершенные задачи';en='Finished Tasks'"),	Истина);

	ОтборЛенты.Добавить("ВзаимодействияВстречи",	НСтр("ru = 'Завершенные встречи'"),				Истина);

	ОтборЛенты.Добавить("Звонки",			НСтр("ru='Звонки';en='Phone Calls'"),					Истина);
	ОтборЛенты.Добавить("ВходящиеЗвонки",	НСтр("ru = 'Входящие'"),								Истина);
	ОтборЛенты.Добавить("ИсходящиеЗвонки",	НСтр("ru = 'Исходящие'"),								Истина);

	ОтборЛенты.Добавить("Письма",			НСтр("ru='Письма';en='Letters'"),						Истина);
	ОтборЛенты.Добавить("ВходящиеПисьма",	НСтр("ru = 'Входящие'"),								Истина);
	ОтборЛенты.Добавить("ИсходящиеПисьма",	НСтр("ru = 'Исходящие'"),								Истина);

	ОтборЛенты.Добавить("ВзаимодействияПрочие",	НСтр("ru = 'Прочие взаимодействия'"),				Истина);

	Если НастройкиЛенты.ИспользоватьЧаты Тогда
		ОтборЛенты.Добавить("Чаты",				НСтр("ru='Чаты';en='Chats'"),						Истина);
		ОтборЛенты.Добавить("ВходящиеЧаты",		НСтр("ru = 'Входящие'"),							Истина);
		ОтборЛенты.Добавить("ИсходящиеЧаты",	НСтр("ru = 'Исходящие'"),							Истина);
	КонецЕсли;

	ОтборЛенты.Добавить("SMS",				НСтр("ru='SMS';en='SMS'"),								Истина);

	Если НастройкиЛенты.Режим = "ЛентаИнтереса" Тогда
		ОтборЛенты.Добавить("ИзменениеСостояния",	НСтр("ru='Изменено состояние';en='Changed State'"), Истина);
	КонецЕсли;
	Если НастройкиЛенты.Режим = "ЛентаИнтереса" Или НастройкиЛенты.Режим = "ЛентаКлиента" Тогда
		ОтборЛенты.Добавить("ИзменениеОтветственного",	НСтр("ru='Смена ответственного';en='Reponsible Person Replacement'"), Истина);
	КонецЕсли;

	ОтборЛенты.Добавить("История",			НСтр("ru='Изменение поля';en='Changing field'"),		Истина);
	ОтборЛенты.Добавить("Примечания",		НСтр("ru='Примечания';en='Comments'"),					Истина);
	ОтборЛенты.Добавить("Документы",		НСтр("ru='Документы';en='Documents'"),					Истина);

	Если НастройкиЛенты.Режим = "ЛентаКлиента" Или НастройкиЛенты.Режим = "ЛентаКонтакта" Тогда
		ОтборЛенты.Добавить("Интересы",			НСтр("ru='Интересы';en='Leads'"),					Истина);
		ОтборЛенты.Добавить("ИнтересыКакПоддержка",			НСтр("ru = 'Обращения в поддержку'"),	Истина);
	КонецЕсли;

	ОтборЛенты.Добавить("Файлы",			НСтр("ru = 'Файлы'"),									Истина);

	Возврат ОтборЛенты;

КонецФункции //-- #Б-3738 смарт: Фролов 08.07.2025

#КонецОбласти
